# pandas

In [3]:
import numpy as np

In [7]:
n = np.array([1,2,3,4,40])

In [8]:
import pandas as pd

In [9]:
x = pd.Series(n)

In [10]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [11]:
type(x)

pandas.core.series.Series

In [12]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [13]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [14]:
b[0]

1

In [15]:
b[2]

[11, 10]

In [16]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [17]:
s = pd.Series([12,52,42,10,23],index=['q','b','e','w','r'])

In [18]:
s

q    12
b    52
e    42
w    10
r    23
dtype: int64

In [19]:
s = pd.Series([12,52,10,52,23,42,10,23])

In [21]:
s

0    12
1    52
2    10
3    52
4    23
5    42
6    10
7    23
dtype: int64

In [23]:
s.value_counts()

52    2
10    2
23    2
12    1
42    1
dtype: int64

s.argmax()

In [24]:
s.argmax()

1

In [25]:
s.argmin()

2

In [26]:
s.idxmin()

2

# Data Frame

In [27]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86])

In [28]:
a

Empty DataFrame
Columns: []
Index: []

In [29]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [30]:
type(b)

pandas.core.frame.DataFrame

In [31]:
c = pd.DataFrame([[1,2,3],[10,20,30],[77,88,99]])

In [32]:
c

    0   1   2
0   1   2   3
1  10  20  30
2  77  88  99

In [34]:
d = pd.DataFrame([[2,3,4,5,7],[11,22,33,44,55],[67,85,76,43,34],[91,92,93,94,95],[54,53,52,51,55]])

In [35]:
d

    0   1   2   3   4
0   2   3   4   5   7
1  11  22  33  44  55
2  67  85  76  43  34
3  91  92  93  94  95
4  54  53  52  51  55

In [36]:
c.head()

    0   1   2   3   4
0   2   3   4   5   7
1  11  22  33  44  55
2  67  85  76  43  34
3  91  92  93  94  95
4  54  53  52  51  55

In [37]:
c.tail()

    0   1   2   3   4
0   2   3   4   5   7
1  11  22  33  44  55
2  67  85  76  43  34
3  91  92  93  94  95
4  54  53  52  51  55

In [38]:
c.tail(3)

    0   1   2   3   4
2  67  85  76  43  34
3  91  92  93  94  95
4  54  53  52  51  55

In [39]:
c.sample()

    0   1   2   3   4
3  91  92  93  94  95

In [40]:
c.sample(5)

    0   1   2   3   4
3  91  92  93  94  95
0   2   3   4   5   7
4  54  53  52  51  55
1  11  22  33  44  55
2  67  85  76  43  34

In [45]:
 e = pd.DataFrame([[2,4,7],[11,22,33,44,55],[67,np.nan,3,34],[91,np.nan,93,95],[54,53,52,51,55]])

In [46]:
e

    0     1   2     3     4
0   2   4.0   7   NaN   NaN
1  11  22.0  33  44.0  55.0
2  67   NaN   3  34.0   NaN
3  91   NaN  93  95.0   NaN
4  54  53.0  52  51.0  55.0

In [48]:
e

    0     1        2     3     4
0   2   4.0        7   NaN   NaN
1  11  22.0  missing  44.0  55.0
2  67   NaN        3  34.0   NaN
3  91   NaN       93  95.0   NaN
4  54  53.0       52  51.0  55.0

# Anisha